# -*- coding: utf-8 -*-
# 对于字符串或者数组，可以通过切片来进行分割
# s[m:n]就表示截取从m到n-1位的字符串 m等于0可以写成s[:n]
# s = "abcde"
# # 从第0位到第2位的字符串
# # print(s[0:3])
# # 但是不会改变s
#
# # # # 除非让他等于他
# # s = s[0:3]
# # print(s)
# # # 如果要倒着截取
# a = "abcde"
# # 倒数第一个元素的索引可以是4也可以是-1
# print(a[-1])
# # 后n个数a[-n:]
# print(a[-1:])
# print(a[-2:])
#
# # 后n到m个数  m是<m 左闭右开
# print(a[-3:-1])

# 反转
# print(a[::-1])

# 上述那些除了字符串，数组也支持
# {:^n}表示格式化字符串,居中对齐长度为n, ^前面没有表示用空格补齐，所以^前面可以自定义字符串
# {:*>30} 右对齐长度为30，不足用*补齐
# {:*<30} 左对齐长度为30，不足用*补齐
# print('{:^30}'.format("ab"))
# print('{:*>30}'.format("ab"))
# print('{:+<30}'.format("ab"))
# .n表示对待填充的字符截取前n位
# print('{:+<30.4}'.format("flower"))

# 千分分隔符：比如数字1234，在千分位上加上逗号1,234，比如12345678，123,456,789
# 实现方法，使用,d的写法。print("{:,d}".format(123456))


# 判断字符串是不是数字
# s = "a"
# print(s.isdigit())
# s = "1"
# print(s.isdigit())

# 判断字符串是不是数字或者字母 但是不支持判断中文哦！！！
# s = 'a'
# print(s.isalnum())
# s = '1a'
# print(s.isalnum())
# s = '1a@'
# print(s.isalnum())
# 判断是不是只是字母  但是不支持判断中文哦！！！
# s = '世界'
# print(s.isalpha())
# s = '1a'
# print(s.isalnum())
# 判断是不是小写
# s = 'a'
# print(s.islower())
# s = 'A'
# print(s.islower())
# 判断是不是大写
# s = 'a'
# print(s.isupper())
# s = 'A'
# print(s.isupper())

# # 大写转小写
# s = 'Tt'
# print(s.lower())
# # 小写转大写
# s = 'Tt'
# print(s.upper())

# # %可以链接字符串
# s = '%s + %s' % ("a", "b")
# print(s)
#
# # 乘号支持字符串
# s = "abc" * 3
# print(s)

# 计算字符串a在字符串b中出现多少次
# s = "dayday day day up"
# # s.count('str', x, y)统计，str在s的第x到y位出现过多少次  统计0到最后一位dayday出现多少次
# print(s.count('day', 0, len(s)))
# print(s.count('day', 0, 7))

# 判断字符串a是否出现在字符串b中,存在返回最开始出现的下标不存在返回-1
# s = 'yanxuliabaer'
# print(s.find('lia'))
# print(s.find('day'))

# strip 删除两边的空白字符串 比如\t和\n是空白字符
# s = "\tsss\n"
# print("----")
# print(s)
# print("----")
# print(s.strip())
# print("----")
#
# # split分割字符串
# s = "1-a,2-b,3-c:b:ccc:d"
# print(s.split(":")[0].split(",")[0].split("-"))

# 字符串参数填充
# 2个同级的大括号，默认按照format函数中的入参顺序默认按照format
# print("{} {}".format("b", "a"))
# # 2个同级大括号，按照大括号中的指定下标格式化
# print("{0} {1}".format("b", "a"))
# # 不一定要都指定
# print("{0} {0}".format("b", "a"))
# print("{1} {1}".format("b", "a"))

# 2个嵌套的大括号,会出现在对齐的写法中
# 单纯的居中
# print("{:^30}".format("我是第0个参数"))
# # 冒号前面其实是默认填写了一个0的，表示指明的是对第0个字符居中
# print("{0:^30}".format("我是第0个参数"))
# 指定第一个参数，第0个参数就没用了
# print("{1:^30}".format("我是第0个参数", "我是第1个参数"))
# 同级写法，假设要打印3个对齐的在一行，默认使用入参顺序
# print("{:<30} {:^30} {:>30}".format("第0个居左", "第1个居中", "第3个居右边"))
# 同级写法指定顺序
# print("{0:<30} {1:^30} {2:>30}".format("第0个居左", "第1个居中", "第3个居右边"))
# 在<左对齐 ^居中 > 右对齐前面可以加格式化的填充字符，上面的例子默认使用的空格，这里我们使用=
print("{0:=<30} {1:=^30} {2:=>30}".format("第0个居左", "第1个居中", "第3个居右边"))
# 上面的等号还可以自定义，这里就涉及到了嵌套的括号 ,0,1,2参数我们已经用了那么我们就用3，4，5参数分割使用=，-，！格式化字符
# 嵌套括号一定要指明所有参数的顺序，不然无法自动识别
# print("{0:{}<30} {1:{}^30} {2:{}>30}".format("第0个居左", "第1个居中", "第3个居右边", "=", "-", "!"))
# print("{:{3}<30} {:{4}^30} {:{5}>30}".format("第0个居左", "第1个居中", "第3个居右边", "=", "-", "!"))
# 以上2种都是错误写法 没有指定完顺序
print("{0:{3}<30} {1:{4}^30} {2:{5}>30}".format("第0个居左", "第1个居中", "第3个居右边", "=", "-", "!"))
